{
  "site_title": "Shanelka",
  "site_description": "Shanelka Pramuditha's personal website",
  "user": {
    "name": {
      "first": "Shanelka",
      "last": "Pramuditha"
    },
    "bio": "I’m a final-year Software Engineering undergraduate at SLIIT, specializing in full-stack development. With hands-on experience in both frontend and backend technologies, I’m passionate about building innovative and user-friendly solutions. I’m constantly learning and excited to tackle real-world challenges in the tech industry.",
    "who_am_i": "I am Shanelka Pramuditha, a third-year Software Engineering undergraduate at SLIIT (Sri Lanka Institute of Information Technology), with a passion for building innovative and scalable software solutions. Currently, I am working as a Software Developer at PurePitch in the Netherlands, where I contribute to cutting-edge projects that leverage modern technologies to solve real-world problems.",
    "description": "With a strong foundation in both frontend and backend development, I specialize in creating seamless, user-centric applications. My expertise includes working with NestJS, Tanstack (React Table, React Query), React, Python, and JavaScript, among other technologies. I am adept at designing robust architectures, optimizing performance, and delivering high-quality solutions that meet both user and business needs."
  },
  "links": {
    "profile_image": "https://github.com/ShanelkaPramuditha.png",
    "cv_link": "https://cv.shanelka.com/Shanelka.pdf",
    "github": "https://github.com/ShanelkaPramuditha",
    "web_site": "https://shanelka.com",
    "calendly": "https://calendly.com/shanelka/30min",
    "social_media": {
      "linkedin": "https://www.linkedin.com/in/shanelkapramuditha",
      "facebook": "https://www.facebook.com/ShanelkaPramuditha",
      "whatsapp": "https://wa.me/94771230577",
      "telegram": "https://t.me/ShanelkaPramuditha"
    },
    "repository": "https://github.com/ShanelkaPramuditha/portfolio"
  },
  "contact": {
    "email": "contact@shanelka.com",
    "phone": "+94771230577"
  },
  "usernames": {
    "github": "ShanelkaPramuditha"
  }
}
